Documents/ВозвратТоваровНаСклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ВозвратТоваровНаСклад</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвиженияТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Итого</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТоварыНаСклад</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Причина</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВозвратТоваровНаСклад/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)    
	СТЧ = Элементы.ТоварыНаСклад.ТекущиеДанные;
	Для Каждого СТЧ Из Объект.ТоварыНаСклад Цикл
		СТЧ.Цена = ПодгрузкаЦен.ПодстановкаЦены(Объект.Дата, СТЧ.Номенклатура);    
		РасчетСуммыВДокументе.РасчетСуммы(СТЧ);
	КонецЦикла
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНаСкладНоменклатураПриИзменении(Элемент) 
	СТЧ = Элементы.ТоварыНаСклад.ТекущиеДанные;
	СТЧ.Цена = ПодгрузкаЦен.ПодстановкаЦены(Объект.Дата, СТЧ.Номенклатура);    
	РасчетСуммыВДокументе.РасчетСуммы(СТЧ);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНаСкладКоличествоПриИзменении(Элемент)
	СТЧ = Элементы.ТоварыНаСклад.ТекущиеДанные;
	РасчетСуммыВДокументе.РасчетСуммы(СТЧ);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНаСкладЦенаПриИзменении(Элемент)
	СТЧ = Элементы.ТоварыНаСклад.ТекущиеДанные;
	РасчетСуммыВДокументе.РасчетСуммы(СТЧ);
КонецПроцедуры

 &НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Итого = Объект.ТоварыНаСклад.Итог("Сумма");
КонецПроцедуры
